RDVMI.rdvmi-ext/src/Catalogs/рдв_ВнешниеСистемы/рдв_ВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВнешниеСистемы</name>
  <predefined>
    <items>
      <name>рдв_Демо</name>
      <description>Демо (РДВ)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяРегламента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/Catalogs/рдв_ВнешниеСистемы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьКонфиденциальныеПараметрыАутентификации(ВнешняяСистема, Параметры) Экспорт
	 
	 Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВнешняяСистема, Параметры);
	 
 КонецФункции
 
 Процедура УстановитьРасписание(Объект, Расписание, ИспользованиеРегламента) Экспорт
	
	УстановитьРасписаниеИнтеграции(Объект, Расписание, ИспользованиеРегламента);	
	
КонецПроцедуры

Процедура УстановитьРасписаниеИнтеграции(Объект, Расписание, Использование) Экспорт
	
	//ТипОчереди = ТипОчередиОбъект.Ссылка;

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Объект.Наименование);

	Если Использование И ПустаяСтрока(Объект.ИмяПользователяРегламента) Тогда
		ИмяПользователя = рдв_ОбщегоНазначения.ИмяИзСинонима(Строка(Объект.Наименование));
		ИмяПользователя = СтрШаблон(НСтр("ru = 'робот_%1'"), ИмяПользователя);
		Объект.ИмяПользователяРегламента = ИмяПользователя;
	КонецЕсли;
	
	ИмяРегламента = ИмяРегламента();
	НаименованиеЗадания = НаименованиеРегламента(Объект);
	//
	МодульУправленияРегламентами = МодульУправленияРегламентами(ИмяРегламента);
	МодульУправленияРегламентами.УстановитьРасписание(ИмяРегламента, Расписание,
		Объект.РегламентноеЗаданиеGUID, НаименованиеЗадания, ПараметрыЗадания,
		Объект.ИмяПользователяРегламента, Использование);
	
КонецПроцедуры

Функция ИмяРегламента() Экспорт
	Возврат "рдв_ЗапускИнтеграции";
КонецФункции

Функция НаименованиеРегламента(Объект) Экспорт
	Наименование = НСтр("ru = 'Интеграция: %1'");
	Наименование = СтрШаблон(Наименование, Строка(Объект.Наименование));
	Возврат Наименование;
КонецФункции

Функция МодульУправленияРегламентами(ИмяРегламента) Экспорт

	Возврат рдв_РегламентныеЗадания;

КонецФункции

Функция ВнешняяСистемаПоИмени(Имя) Экспорт
	
	Возврат Справочники.рдв_ВнешниеСистемы.НайтиПоНаименованию(Имя);
	
КонецФункции

#КонецОбласти

#КонецЕсли
